{
  "aliases": [
  ],
  "alliances": [
    "Alpha Squadron training squad",
    "New X-Men",
    "Xavier Institute",
    "X-Men-In-Training",
    "Young X-Men",
    "Jean Grey School Students",
    "X-Men"
  ],
  "authors": [
    "Nunzio DeFilippis",
    "Christina Weir",
    "Carlo Barberi"
  ],
  "description": "Anole (Victor Borkowski) is a fictional mutant superhero in the Marvel Universe. He was created by Christina Weir and Nunzio DeFilippis and first appeared in issue #2 of New Mutants vol. 2 (August 2003). A student at the Xavier Institute and junior member of the X-Men, Anole is one of the few openly gay characters in the Marvel Universe. His reptilian mutation grants him superhuman abilities including wallcrawling, a prehensile tongue, and adaptive camouflage.Initially a supporting character in New Mutants vol. 2 and its relaunched title, New X-Men: Academy X, Weir and DeFilippis intended for the character to commit suicide early in the series after coming out as gay and finding himself rejected by his family and friends. According to the writers, the story was to serve as a message about intolerance. Marvel editors scrapped the story due to concerns about the controversy it might generate. The storyline was rewritten and the character survived. He since became a fan favorite and began to be featured regularly throughout the series and as a main character in subsequent X-Men-related titles, including New X-Men and the short-lived Young X-Men.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/9/20/4c002e635ddd9/standard_xlarge.jpg",
  "isHero": true,
  "isVillain": false,
  "name": "Anole",
  "partners": [
  ],
  "powers": [
    "Green scaly skin",
    "Spiked head carapace",
    "Prehensile sticky tongue",
    "Superhuman agility",
    "speed",
    "reflexes/reactions",
    "coordination",
    "balance",
    "Wallcrawling",
    "Regeneration",
    "Camouflage"
  ],
  "ranking": {
    "comicCount": 1,
    "eventCount": 0,
    "pageviewCount": 2994,
    "pageviewRank": -1,
    "serieCount": 1,
    "storyCount": 1
  },
  "secretIdentities": [
    "Victor \"Vic\" Borkowski"
  ],
  "species": [
    "Mutant"
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/155/anole",
    "wikipedia": "https://en.wikipedia.org/wiki/Anole_(comics)"
  }
}