{
  "aliases": [
  ],
  "alliances": [
    "Scorpio",
    "Zodiac"
  ],
  "authors": [
    "Al Milgrom",
    "David Anthony Kraft",
    "Steven T. Seagle",
    "Steve Englehart",
    "Bob Brown",
    "Luke McDonnell",
    "Dennis O'Neil",
    "Mark Bagley",
    "Duncan Rouleau",
    "Brian Michael Bendis",
    "Keith Giffen"
  ],
  "description": "The various incarnations of Aries are Marvel Comics supervillains who were members of various incarnations of the supervillain group, the Zodiac.In the history of the Marvel Universe, seven different characters have assumed the role of Aries. All of them have been members of the villainous Zodiac and used horns on their head to ram their opponents. The third Aries was a Life Model Decoy created by Jake Fury. The second and fourth Aries' were African-American.",
  "isHero": false,
  "isVillain": false,
  "name": "Aries",
  "partners": [
  ],
  "powers": [
    "Wore a ram's horns upon his head",
    "would ram his opponents in battle. He often carried a Star-Blazer",
    "a pistol which could fire energy blasts. While possessed by Lucifer",
    "his body was charged with ionic energy",
    "granting him superhuman strength.",
    "Wore the horns of a ram on his head which he could use to ram opponents.",
    "Possessed superhuman strength",
    "shapshifting ability",
    "Possessed a pair of horns on its head",
    "enhanced strength",
    "would attempt to ram its opponents in battle. In its most recent form",
    "it also wore a suit of protective armor",
    "could project fire from its horns. As a LMD",
    "it could also exist underwater.",
    "Wore a pair of ram's horns upon his head which he could use to ram opponents in battle. He briefly possessed the Zodiac Key",
    "which he was able to use to channel energy blasts",
    "powered his ship's force field",
    "which he used to surround all of Manhattan.",
    "had horns",
    "wielded a gun",
    "used the Zodiac's teleportation device."
  ],
  "ranking": {
    "comicCount": 0,
    "eventCount": 0,
    "pageviewCount": 747,
    "pageviewRank": -1,
    "serieCount": 0,
    "storyCount": 0
  },
  "secretIdentities": [
    "Marcus Lassiter",
    "Grover Raymond",
    "Unrevealed",
    "?",
    "None"
  ],
  "species": [
  ],
  "urls": {
    "wikipedia": "https://en.wikipedia.org/wiki/Aries_(comics)"
  }
}