{
  "aliases": [
  ],
  "alliances": [
    "Big Hero 6"
  ],
  "authors": [
    "Duncan Rouleau",
    "Steven T. Seagle"
  ],
  "description": "Baymax is a fictional character, a superhero in the Marvel Comics Universe. Created by Steven T. Seagle and Duncan Rouleau, Baymax first appeared in Sunfire & Big Hero 6 #1. Baymax begins his existence as Hiro Takachiho's science project. Originally designed to be a hydro-powered robotic synthformer programmed to serve as Hiro's personal bodyguard, butler, and chauffeur, Baymax becomes Hiro's best friend and father figure when the young inventor programs his recently deceased father's brain engrams into Baymax's artificial intelligence. When the Giri recruits Hiro into the fledgling super-team Big Hero 6, Baymax also joins the team, where his phenomenal strength, and amazing surveillance and data analysis capabilities have proven useful.Baymax is an artificial synthformer capable of synthtransing his body into various forms: a large humanoid male, \"Battle-Dragon\" and \"Action-Mecha\". The first serves as his default form, designed to be less conspicuous in public while attending to Hiro's daily needs. His other forms, significantly more powerful and imposing, are primarily used during undercover missions and other hostile operations. In all forms, Baymax has internal scanners and sensors able to detect and evaluate threats posed by nearby lifeforms. He is also programmed with fighting techniques from forms of combat including karate, tae kwon do, Western boxing, and Wing Chun. Baymax appears in the 2014 Disney animated film Big Hero 6, voiced by Scott Adsit, and in the videogame Disney Infinity: Marvel Super Heroes. In the film and the game, he is depicted as an inflatable robot built by Tadashi, the older brother of the protagonist Hiro Hamada, to serve as a healthcare companion.",
  "image": "https://upload.wikimedia.org/wikipedia/en/thumb/2/21/Baymax_%28Marvel_Comics%29.jpg/250px-Baymax_%28Marvel_Comics%29.jpg",
  "isHero": true,
  "isVillain": false,
  "name": "Baymax",
  "partners": [
    "Hiro Takachiho"
  ],
  "powers": [
    "Morph body into dragon or mecha"
  ],
  "ranking": {
    "comicCount": 0,
    "eventCount": 0,
    "pageviewCount": 22016,
    "pageviewRank": -1,
    "serieCount": 0,
    "storyCount": 0
  },
  "secretIdentities": [
  ],
  "species": [
    "Synthetic entity"
  ],
  "urls": {
    "wikipedia": "https://en.wikipedia.org/wiki/Baymax"
  }
}