{
  "aliases": [
    "Hank McCoy",
    "Henry McCoy",
    "Blue Gorilla",
    "Kreature",
    "Mutate #666",
    "Beast"
  ],
  "alliances": [
    "X-Men",
    "X-Club",
    "S.W.O.R.D.",
    "Xavier Institute For Higher Learning",
    "Avengers",
    "Defenders",
    "X-Factor",
    "X-Terminators",
    "Secret Avengers",
    "Illuminati",
    "Jean Grey School",
    "All New X-Men"
  ],
  "authors": [
    "Stan Lee",
    "Jack Kirby"
  ],
  "description": "Beast (Henry Philip \"Hank\" McCoy) is a fictional character, a superhero that appears in comic books published by Marvel Comics. He is a founding member of the mutant team of superheroes known as the X-Men. When he was first introduced, the Beast is a mutant who possesses ape-like superhuman physical strength and agility and oversized hands and feet, though he otherwise appears to be a normal human being. Throughout his history, the Beast undergoes progressive transformations to his physiognomy, permanently gaining increasingly animalistic physical characteristics. These include blue fur, feline facial features, pointed ears, fangs, and claws. His physical power increases to even greater levels, as do his senses.Despite his inhuman appearance, he is a brilliant man of the arts and sciences; he is a world authority on biochemistry and genetics, the X-Men's medical doctor, and the science and mathematics instructor at the Xavier Institute (the X-Men's headquarters and school for young mutants). He is also a mutant political activist. Fighting his bestial instincts and fears of social rejection, the Beast dedicates his physical and mental gifts to the creation of a better world for man and mutant. He also has a witty sense of humor.One of the original X-Men, the Beast has appeared regularly in X-Men-related comics throughout the years. He has also been a member of the \"all-star\" teams the Avengers and Defenders.The character has also appeared in media adaptations, including animated TV series and feature films. In X2, Steve Bacic portrayed him in a very brief cameo in a newscast scene as a human, while in X-Men: The Last Stand he was played by Kelsey Grammer. Nicholas Hoult portrays the younger version of the character in X-Men: First Class. Both Kelsey Grammer and Nicholas Hoult reprise their roles in X-Men: Days of Future Past.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/2/80/511a79a0451a3/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Beast",
  "partners": [
  ],
  "powers": [
    "Animal-like physiology",
    "Superhuman strength",
    "speed",
    "stamina",
    "agility",
    "durability",
    "senses",
    "dexterity",
    "Genius-level intellect",
    "High pain tolerance",
    "Pheromone manipulation",
    "Razor sharp claws",
    "teeth"
  ],
  "ranking": {
    "comicCount": 567,
    "eventCount": 21,
    "pageviewCount": 28638,
    "pageviewRank": -1,
    "serieCount": 161,
    "storyCount": 618
  },
  "secretIdentities": [
    "Henry Philip \"Hank\" McCoy"
  ],
  "species": [
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/3/beast",
    "wikipedia": "https://en.wikipedia.org/wiki/Beast_(comics)"
  }
}