{
  "aliases": [
    "Blue Ear"
  ],
  "alliances": [
  ],
  "authors": [
  ],
  "description": "Blue Ear is a superhero in the Marvel Comics Universe. Marvel created the character in honor of Anthony Smith, a hard-of-hearing 4-year-old comic book fan from Salem, New Hampshire, USA. Smith has no hearing in his right ear and minimal hearing in his left because he suffers from Mosaic trisomy 22.Smith was given a hearing aid by his mother, Christina D'Allesandro, and was using it regularly until he became depressed and refused to wear it to school in 2012. According to Smith, \"superheroes don't wear blue ears.\" D'Allesandro was alarmed by this and emailed Marvel Comics in New York City for assistance with the situation. Designer and assistant editor, Nelson Ribeiro, then created the original image of the Blue Ear and sent it to the D'Allesandro family. Later, production artist Manny Mederos started working on a sketch of Blue Ear as a kid. Mederos told Huffington Post that during the creative process, Mederos had an idea: \"Why not have the superhero be a young kid himself?\" Marvel Comics responded by sending D'Allesandro comics of Hawkeye from the 1980s, when the superhero lost 80% of his hearing and had to wear hearing aids, along with a drawing of \"The Blue Ear,\" a superhero based on Anthony, saying, \"Thanks to my listening device I hear someone in trouble!\"D'Allesandro stated that Smith took the comic book pictures to his preschool, which pushed teachers to have a \"superhero week.\" Smith's grandfather, New Hampshire senator Lou D'Allesandro, stated, \"This is a feel good moment, it's a feel good story, and we've got to get the world to recognize that.\" In March 2013, Smith attended an event at the Center for Hearing and Communication to debut a poster.",
  "isHero": false,
  "isVillain": false,
  "name": "Blue Ear",
  "partners": [
  ],
  "powers": [
  ],
  "ranking": {
    "comicCount": 0,
    "eventCount": 0,
    "pageviewCount": 1176,
    "pageviewRank": -1,
    "serieCount": 0,
    "storyCount": 0
  },
  "secretIdentities": [
  ],
  "species": [
  ],
  "urls": {
    "wikipedia": "https://en.wikipedia.org/wiki/Blue_Ear_(comics)"
  }
}