{
  "aliases": [
    "Disco Dazzler",
    "Alison Blaire"
  ],
  "alliances": [
    "S.H.I.E.L.D.",
    "Excalibur",
    "X-Men",
    "Wildways Rebellion",
    "Gladiators",
    "X-Men: The 198"
  ],
  "authors": [
    "Group of Marvel Comics staff: Tom DeFalco",
    "John Romita, Jr.",
    "Louise Simonson",
    "and Roger Stern"
  ],
  "description": "Dazzler (Alison Blaire) is a Marvel Comics superheroine, usually associated with the X-Men. She first appeared in Uncanny X-Men #130 (February 1980).A mutant with the ability to convert sound vibrations into light and energy beams, Dazzler was originally developed as a cross-promotional, multi-media creation between Casablanca Records and Marvel Comics until the tie-ins were dropped in 1980. The character was created by a committee of Marvel staff, principally writer/editor Tom DeFalco and illustrator John Romita, Jr.Despite the fact that Dazzler was originally commissioned as a disco singer, the character shifted to other musical genres, including rock and adult contemporary. She starred in a self-titled solo series in the early 1980s which lasted forty-two issues, a Marvel Graphic Novel titled Dazzler: The Movie, a four-issue limited series co-starring The Beast titled Beauty and the Beast, and later joined the cast of the X-Men. She was briefly a member of the spin-off group Excalibur but has since re-joined the X-Men.  Dazzler was ranked 83rd in Comics Buyer's Guide's \"100 Sexiest Women in Comics\" list.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/6/10/4fe364b0a2177/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Dazzler",
  "partners": [
  ],
  "powers": [
    "Trained singer",
    "actress",
    "dancer",
    "Highly skilled athlete",
    "Ability to convert sound into light beams of various forms",
    "intensity",
    "Highly accomplished roller-skater"
  ],
  "ranking": {
    "comicCount": 157,
    "eventCount": 6,
    "pageviewCount": 11831,
    "pageviewRank": 1746,
    "serieCount": 51,
    "storyCount": 200
  },
  "secretIdentities": [
    "Alison \"Ali\" Blaire"
  ],
  "species": [
    "Mutant"
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/516/dazzler",
    "wikipedia": "https://en.wikipedia.org/wiki/Dazzler"
  }
}