{
  "aliases": [
    "Dust"
  ],
  "alliances": [
    "New X-Men",
    "Young X-Men",
    "X-Mansion",
    "Hellions",
    "Hellions training squad",
    "Xavier Institute",
    "X-Men-In-Training",
    "Jean Grey School Students"
  ],
  "authors": [
    "Frank Quitely",
    "Ethan Van Sciver",
    "Grant Morrison"
  ],
  "description": "Dust (real name Sooraya Qadir), is a fictional character, a superheroine in Marvel Comics' X-Men-related comic books. She was created by author Grant Morrison and artist Ethan Van Sciver in New X-Men #133 (December 2002), although her character was not fully developed until the New X-Men: Academy X series written by Christina Weir and Nunzio DeFilippis. Sooraya is a mutant with the ability to transform her body into a malleable cloud of dust. The X-Men travel to Afghanistan to rescue Sooraya, whose abilities have made her the target of slavers.Born in Afghanistan, Sooraya is attacked by a slave trader attempting to remove her traditional niqāb; almost instinctively, she lashes out with her powers and flays him alive with her sand-like dust. The X-Men, hearing of the situation, travel to Afghanistan and rescue her, where she is brought to the USA and becomes a student of the Xavier Institute for Higher Learning. After the actions of the Scarlet Witch (in which millions of mutants lost their powers), Sooraya remains one of the few mutants to keep their powers. She is currently a member of the Young X-Men team. She is a rare example of a positive Muslim comic book character.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/8/f0/4c003f17db9a6/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Dust",
  "partners": [
  ],
  "powers": [
    "Able to transform into",
    "control a malleable sand form"
  ],
  "ranking": {
    "comicCount": 8,
    "eventCount": 0,
    "pageviewCount": 5065,
    "pageviewRank": -1,
    "serieCount": 6,
    "storyCount": 7
  },
  "secretIdentities": [
    "Sooraya Qadir"
  ],
  "species": [
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/588/dust",
    "wikipedia": "https://en.wikipedia.org/wiki/Dust_(comics)"
  }
}