{
  "aliases": [
    "Rémy LeBeau"
  ],
  "alliances": [
    "Horsemen of Apocalypse",
    "Marauders",
    "All-New X-Factor",
    "X-Men",
    "Thieves' guild",
    "LeBeau Clan",
    "X-Mansion",
    "X-Treme Sanctions Executive",
    "Crimson Pirates"
  ],
  "authors": [
    "Jim Lee",
    "Chris Claremont"
  ],
  "description": "Gambit is a fictional character, a superhero who appears in comic books published by Marvel Comics. He has held membership in the team known as the X-Men. Created by writer Chris Claremont and artist Jim Lee, the character first appeared briefly in Uncanny X-Men Annual #14 (1990), weeks before a more comprehensive appearance in Uncanny X-Men #266 (August 1990). As of 2013, there have been three attempts at an ongoing title starring the character. Gambit also had two miniseries and starred prominently in the X-Force replacement title during the Age of Apocalypse, Gambit & the X-Ternals.A mutant, Gambit can mentally create, control and manipulate pure kinetic energy to his every whim and desire. He is also incredibly knowledgeable and skilled in card-throwing, hand-to-hand combat, and the use of a bō.Few X-Men trusted Gambit, who was originally a professional thief, when he first joined the group. There was consistently a source of stress between him and his on-again, off-again love interest Rogue. This was exacerbated when his connections to villain Mister Sinister were revealed, although some of his team members accept that Gambit honestly seeks redemption.Often written as a \"ladies' man\", Gambit has shown a more vulnerable side of himself over the years, especially when it comes to Rogue. Gambit remains fiercely proud of his Louisiana heritage, and speaks in a very thick Cajun accent.Though he did not appear in the first three X-Men films, Gambit appeared on screen in the 2009 film X-Men Origins: Wolverine, portrayed by Taylor Kitsch. Channing Tatum will portray Gambit in an upcoming solo film to be released October 7, 2016.Gambit has appeared in more than one solo series since his debut in 1990. Gambit was ranked 65th on IGN's \"Top 100 Comic Book Heroes of All Time\" stating that \"Gambit is just the sort of tortured soul that X-readers love, and his continued presence in the TV and movie spinoffs cements his status as one of the greats.\" He has been featured in several animated series and video games based on the X-Men.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/a/40/52696aa8aee99/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Gambit",
  "partners": [
  ],
  "powers": [
    "Control",
    "manipulation of potential energy",
    "kinetic energy",
    "Enhanced physical abilities",
    "Hypnotic charm",
    "Highly skilled in Savate",
    "Bōjutsu",
    "Transmutation of substances into acid or poison"
  ],
  "ranking": {
    "comicCount": 299,
    "eventCount": 11,
    "pageviewCount": 58635,
    "pageviewRank": -1,
    "serieCount": 85,
    "storyCount": 375
  },
  "secretIdentities": [
    "Remy Etienne LeBeau"
  ],
  "species": [
    "Mutant"
  ],
  "urls": {
    "marvel": "http://marvel.com/comics/characters/1009313/gambit",
    "wikipedia": "https://en.wikipedia.org/wiki/Gambit_(comics)"
  }
}