{
  "aliases": [
  ],
  "alliances": [
    "Avengers",
    "Fantastic Four Incorporated",
    "Future Foundation",
    "Lady Liberators",
    "Fantastic Four"
  ],
  "authors": [
    "Stan Lee",
    "Jack Kirby"
  ],
  "description": "The Invisible Woman (real name Susan \"Sue\" Storm Richards, previously known as the Invisible Girl) is a fictional character, a superheroine that appears in comic books published by Marvel Comics. She was the first female superhero created by Marvel in the Silver Age of Comics. Like the other founding members of the Fantastic Four, Sue received her powers after being exposed to a cosmic storm. Her primary power deals with light waves, allowing her to render herself and others invisible. She can also project powerful fields of invisible psionic energy which she uses for a variety of offensive and defensive effects. Sue plays a central role in the lives of her hot-headed brother Johnny Storm, her brilliant husband Reed Richards, her close friend Ben Grimm, and her children (Franklin and Valeria).An object of infatuation for Doctor Doom and, most notably, Namor the Sub-Mariner, Sue's passive invisibility power translated into her frequent deployment as a damsel in distress during the team's early adventures. Upon developing the ability to project powerful fields of energy, Sue Storm became a more powerful member of the Fantastic Four, and the team's second-in-command with a growing assertive confidence. While Sue operated somewhat in the shadow of her brother and her husband in the early years, she is now the soul of the Fantastic Four and one of the premiere heroes in the Marvel Universe.The Invisible Woman was portrayed by Rebecca Staab in the 1994 film The Fantastic Four, and Jessica Alba played her in the 2005 film Fantastic Four, and its 2007 sequel Fantastic Four: Rise of the Silver Surfer. Kate Mara has been announced to play the Invisible Woman in 2015's Fantastic Four reboot.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/6/a0/52695b9cd40b6/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Invisible Woman",
  "partners": [
  ],
  "powers": [
    "Projected invisibility",
    "Invisibility",
    "Invisible force field projection"
  ],
  "ranking": {
    "comicCount": 390,
    "eventCount": 17,
    "pageviewCount": 21326,
    "pageviewRank": -1,
    "serieCount": 143,
    "storyCount": 488
  },
  "secretIdentities": [
    "Susan \"Sue\" Storm Richards"
  ],
  "species": [
    "Mutate"
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/1047/invisible_woman",
    "wikipedia": "https://en.wikipedia.org/wiki/Invisible_Woman"
  }
}