{
  "aliases": [
    "Jubilation Lee"
  ],
  "alliances": [
    "Generation X",
    "Forgiven",
    "New Warriors",
    "X-Men",
    "X-Corps",
    "X-Mansion"
  ],
  "authors": [
    "Marc Silvestri",
    "Chris Claremont"
  ],
  "description": "Jubilee (Jubilation Lee) is a fictional character, a Marvel Comics superheroine associated with the X-Men.A mutant, Jubilee had the superhuman power to generate pyrotechnic energy plasmoids out of her hands.  She is often illustrated wearing a yellow trench coat.  A teenage \"mall rat,\" she was the X-Men's youngest member in the early 1990s, often playing sidekick to Wolverine. She eventually joined the junior team Generation X. She was a prominent character in the 1990s-era X-Men animated series. In late 2004, Marvel launched a self-titled series for Jubilee set in Los Angeles, written by Robert Kirkman and covers by Casey Jones; it was canceled after six issues. She also has cameo appearances in all three X-Men films; she is portrayed by Katrina Florence in X-Men and by Kea Wong in X2: X-Men United and X-Men: The Last Stand.Jubilee is one of the depowered mutant characters who later reappeared using technology-based powers in the New Warriors comic series. She has since been turned into a vampire where she gained vampire-like powers.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/6/c0/4e7a2148b6e59/standard_xlarge.jpg",
  "isHero": true,
  "isVillain": false,
  "name": "Jubilee",
  "partners": [
  ],
  "powers": [
    "Possesses the powers",
    "abilities of a vampire.",
    "Concussive blasts",
    "Ability to explosively charge objects.",
    "Ability to evade the detection of telepaths",
    "Ability to project pyrotechnic energy plasmoids"
  ],
  "ranking": {
    "comicCount": 170,
    "eventCount": 8,
    "pageviewCount": 57114,
    "pageviewRank": -1,
    "serieCount": 33,
    "storyCount": 191
  },
  "secretIdentities": [
    "Jubilation \"Jubilee\" Lee"
  ],
  "species": [
    "Vampire"
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/1103/jubilee",
    "wikipedia": "https://en.wikipedia.org/wiki/Jubilee_(comics)"
  }
}