{
  "aliases": [
  ],
  "alliances": [
    "Runaways"
  ],
  "authors": [
    "Adrian Alphona",
    "Brian K. Vaughan"
  ],
  "description": "Karolina Dean (/kæˈroʊliːnə/ kair-ROH-lee-nə), also briefly known as Lucy in the Sky, is a fictional character in the Marvel Comics award-winning series, Runaways. She was created by author Brian K. Vaughan & artist Adrian Alphona, and debuted in Runaways #1 (April 2003) with most of the other main characters. Like every member of the original Runaways, she is the daughter of evil super-powered criminals; while searching through her parents' home, Karolina inadvertently discovers that her parents were Majesdanian invaders. Majesdanians are an alien race that absorbs solar energy and reradiates it in the form of the colors of the rainbow. She is often called \"Kar\" or \"K\" for short, and is known for her free spirit and kind nature. She is a vegan and peace keeper, and once mentioned as being a protester. Karolina is the group's only lesbian character. She is the only extraterrestrial in the group, except for a period of time when her Skrull fiancee, Xavin, becomes part of the team. Runaways creator Brian K. Vaughan played a significant role in the character's subsequent development as well as artist/writer Adrian Alphona, both of whom spent most of the first volume of the series hinting that Karolina was romantically attracted to fellow member Nico Minoru.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/d/50/4c00377435871/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Lucy in the Sky",
  "partners": [
  ],
  "powers": [
    "Manipulates solar light energy to generate lasers",
    "concussive blasts",
    "forcefields",
    "Flight"
  ],
  "ranking": {
    "comicCount": 0,
    "eventCount": 0,
    "pageviewCount": 4223,
    "pageviewRank": -1,
    "serieCount": 0,
    "storyCount": 0
  },
  "secretIdentities": [
    "Karolina Dean"
  ],
  "species": [
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/1285/lucy_in_the_sky",
    "wikipedia": "https://en.wikipedia.org/wiki/Karolina_Dean"
  }
}