{
  "aliases": [
    "Shadowcat",
    "Ariel",
    "Sprite",
    "Katherine Pryde"
  ],
  "alliances": [
  ],
  "authors": [
    "Chris Claremont",
    "John Byrne"
  ],
  "description": "Katherine Anne \"Kitty\" Pryde is a fictional character and superhero that appears in comic books published by Marvel Comics. The character first appeared in Uncanny X-Men #129 (January 1980) and was co-created by writer-artist John Byrne and Chris Claremont.A mutant, Pryde possesses a \"phasing\" ability that allows her and objects or people with which she is in contact to become intangible. This power also disrupts any electrical field she passes through, and lets her simulate levitation.Storm christened Kitty with her first code name, Sprite.  Professor X had also suggested the codename Ariel, which Kitty adopted for a short time prior to adopting the codename Shadowcat.  Pryde was the youngest person invited to join the team of mutant superheroes the X-Men.During her early years, she was portrayed as a \"kid sister\" to many older members of the X-Men, filling the role of literary foil to the more established characters. In the years since her introduction, she has aged and matured, and has become a main character on her own.In the X-Men film series, Kitty Pryde was portrayed by young actresses in cameos in the first two films, Sumela Kay in X-Men (2000) and Katie Stuart in X2 (2003), and is portrayed by Ellen Page in X-Men: The Last Stand (2006) and X-Men: Days of Future Past (2014). She is ranked #47 in IGN's Top 100 Comic Book Heroes.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/4/03/5261677b30b64/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Kitty Pryde",
  "partners": [
  ],
  "powers": [
  ],
  "ranking": {
    "comicCount": 151,
    "eventCount": 7,
    "pageviewCount": 47350,
    "pageviewRank": -1,
    "serieCount": 60,
    "storyCount": 163
  },
  "secretIdentities": [
    "Katherine Anne \"Kitty\" Pryde"
  ],
  "species": [
    "Mutant"
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/32/kitty_pryde",
    "wikipedia": "https://en.wikipedia.org/wiki/Kitty_Pryde"
  }
}