{
  "aliases": [
  ],
  "alliances": [
    "S.H.I.E.L.D.",
    "X-Force",
    "X-Men",
    "X-Cell",
    "Weapon X",
    "Morlocks"
  ],
  "authors": [
    "Scott Lobdell",
    "Joe Madureira",
    "Jeph Loeb",
    "David Brewer"
  ],
  "description": "Marrow (Sarah), is a Marvel Comics character, associated with the X-Men franchise. She is a mutant whose bones grow out of her skin and can be removed from her body, providing her with potential knives and clubs as well as body armor.As a child, Marrow was taken in by the Morlocks, a band of grotesque-looking mutants who hid in tunnels beneath New York City. As a young adult, she formed the violent splinter cell Gene Nation until, under the orders of Morlock leader Callisto, she joined the X-Men to redeem herself. She made progress controlling her powers and learning a moral code, but eventually fell in with the paramilitary group Weapon X.As a child, Marrow first appeared in Cable #15 (September 1994) and was created by writer Jeph Loeb and artist David Brewer. However, Uncanny X-Men writer Scott Lobdell and artist Joe Madureira defined her powers and temperament.She has shown herself to be a staunch team player (more-so with the X-Men than with either Gene Nation or Weapon X) who is prepared to risk her own life to protect those of her teammates. Despite her apparent disdain for humanity, she has revealed that she would like nothing more than to be able to fit in with them and be happy.While there have been occasions that this has happened for her (in an art gallery with Colossus and immediately following her genetic redesign by Weapon X), they have never lasted long and only served to increase her anger and bitterness towards the world when they have been taken away from her.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/5/a0/4c003d4ce6711/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Marrow",
  "partners": [
  ],
  "powers": [
    "controlled bone growth",
    "regenerative healing factor",
    "superhuman strength",
    "stamina",
    "durability",
    "agility"
  ],
  "ranking": {
    "comicCount": 75,
    "eventCount": 1,
    "pageviewCount": 7933,
    "pageviewRank": -1,
    "serieCount": 20,
    "storyCount": 91
  },
  "secretIdentities": [
    "Sarah"
  ],
  "species": [
    "Mutant"
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/1375/marrow",
    "wikipedia": "https://en.wikipedia.org/wiki/Marrow_(comics)"
  }
}