{
  "aliases": [
  ],
  "alliances": [
    "Avengers: The Initiative",
    "New Warriors",
    "Counter Force"
  ],
  "authors": [
    "Stefano Caselli",
    "Dan Slott"
  ],
  "description": "Michael \"Mike\" Ian Van Patrick is a fictional comic book character created by Dan Slott and Stefano Caselli. Although the character himself is deceased, and in fact died in the issue he first appeared in, the character is said to have been cloned after his death, with his clones continuing to play roles within the ongoing series.Described by Slott as an archetypal \"all-American boy\", the character is introduced in the pages of Avengers: The Initiative #1 as the great-grandson of Dr. Abraham Erskine, the inventor of the super soldier serum within Marvel Comics' shared universe the Marvel Universe, before being subsequently killed at the end of that first issue.The first clone replaced Michael, and was sent back to his parent's home to prevent them from learning of his death. The next three clones, named Michael, Van, and Patrick, originally worked as the Scarlet Spiders, as part of the Black Ops group within The Initiative. They were revealed to be clones in Avengers: The Initiative #7. He was cloned once more, in the Killed in Action story arc when plans were made to fill some of the vacant positions in the Initiative teams with MVP clones.The original Michael Van Patrick's only appearance outside the pages of Avengers: The Initiative was a brief cameo in an alternate reality What If comic. All that is known about the original character has been revealed throughout the ongoing series, with Van Patrick's (and the first sets of clones) origins being shown in the 2007 Avengers: The Initiative Annual. However, the Scarlet Spiders (Michael and Patrick) became the first clones to appear outside The Initiative when they appeared in New Warriors vol. 4 #14 (September 2008), with the first MVP clone appearing in the following issue of the New Warriors series.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/9/50/4ce5a36f31b94/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "MVP",
  "partners": [
  ],
  "powers": [
    "Peak human intelligence",
    "strength",
    "speed",
    "reflexes",
    "agility",
    "endurance."
  ],
  "ranking": {
    "comicCount": 3,
    "eventCount": 1,
    "pageviewCount": 1680,
    "pageviewRank": -1,
    "serieCount": 3,
    "storyCount": 2
  },
  "secretIdentities": [
    "Michael Ian Van Patrick"
  ],
  "species": [
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/1545/mvp",
    "wikipedia": "https://en.wikipedia.org/wiki/Michael_Van_Patrick"
  }
}