{
  "aliases": [
  ],
  "alliances": [
    "Sgt. Fury and his Howling Commandos",
    "Secret Warriors",
    "S.H.I.E.L.D.",
    "Central Intelligence Agency",
    "Great Wheel",
    "United States Army"
  ],
  "authors": [
    "Jack Kirby",
    "Stan Lee"
  ],
  "description": "This article is about the first character named Nick Fury. For his son, see Nick Fury, Jr.Colonel Nicholas Joseph \"Nick\" Fury is a fictional character appearing in comic books published by Marvel Comics. Created by writer/artist Jack Kirby and writer Stan Lee, Fury first appeared in Sgt. Fury and his Howling Commandos #1 (May 1963), a World War II combat series that portrayed the cigar-chomping Fury as leader of an elite U.S. Army unit. A popular character over a number of decades, in 2011, Fury was ranked 33rd in IGN's Top 100 Comic Book Heroes. He has sometimes been considered an antihero.The modern-day Fury, initially a CIA agent, debuted a few months later in Fantastic Four #21 (Dec. 1963). In Strange Tales #135 (Aug. 1965), the character was transformed into a spy like James Bond and leading agent of the fictional espionage agency S.H.I.E.L.D. The character makes frequent appearances in Marvel books as the former head of S.H.I.E.L.D. and as an intermediary between the U.S. government or the United Nations and various superheroes. It is eventually revealed that Fury takes a special medication called the Infinity Formula that halted his aging and allows him to be active despite being nearly a century old.Nick Fury appears in several Marvel series set in alternate universes, as well as multiple animated films, television shows, and video games based on the comics. The character was first portrayed in live action by David Hasselhoff in the 1998 television movie Nick Fury: Agent of S.H.I.E.L.D. Samuel L. Jackson later signed a nine-picture deal to portray the character in the Marvel Cinematic Universe franchise, first appearing in the 2008 film Iron Man. Jackson also cameos in multiple episodes of the related Marvel television show Agents of S.H.I.E.L.D. A version of the character appearing in Marvel's Ultimate Marvel imprint was based on Jackson's appearance and screen persona, well before he was cast in the role. The recognizability of the character portrayed by Jackson in the films later led Marvel to retire the original character, replacing him with his African American son Nick Fury, Jr., who like the Ultimate Marvel version is patterned on Jackson.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/3/c0/5261a745e658d/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Nick Fury",
  "partners": [
  ],
  "powers": [
    "Halted aging from the Infinity Formula",
    "Skilled with many weapons",
    "fighting techniques",
    "Skilled",
    "experienced soldier"
  ],
  "ranking": {
    "comicCount": 279,
    "eventCount": 10,
    "pageviewCount": 38813,
    "pageviewRank": 9482,
    "serieCount": 123,
    "storyCount": 275
  },
  "secretIdentities": [
    "Nicholas Joseph \"Nick\" Fury"
  ],
  "species": [
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/2782/nick_fury",
    "wikipedia": "https://en.wikipedia.org/wiki/Nick_Fury"
  }
}