{
  "aliases": [
  ],
  "alliances": [
  ],
  "authors": [
  ],
  "description": "Pixx was a fictional character from Malibu Comics, created by Gerard Jones and Jeff Parker. She first appeared in Giant-Size Freex #1.Penny Burka was a normal child until her powers surfaced, causing her to uncontrollably project hallucinatory images to those around her. Her terrified parents contacted the Academy of the New Elite, a special school for those with unusual powers. Taking the name Pixx, she soon learned that her powers also extended to enormous technical prowess, and she quickly mastered the advanced Fire People technology housed at the Academy.Because of her mastery of this technology, Contrary selected Pixx to join her in investigating the Fire People's theft of nuclear missiles. in Ultraforce #1, they encountered Hardcase and Ghoul, both also investigating the thefts, and the group banded together to form Ultraforce. Pixx was disturbed by the attentions of the zombie-like Ghoul, who sensed imminent death around her. Ghoul tried on several occasions to get Pixx to leave the group, to no avail.As the Ultraforce faced the Fire People, Pixx determined that only her technical skills could allow her to disable all the stolen nuclear missiles before they could be launched. Although her radiation suit was damaged, she quickly began to disarm the warheads, at the cost of severe radiation sickness from a previous detonation. Ghoul pleaded with her to stop, but she had already received a lethal dose, and had to hurry to complete the process before her body failed. As her sight faded and she was wracked with nausea, she worked by touch and memory to disarm the final missile, just seconds before her death. Atalon, the Fire People's leader, collapsed the cavern, and Ghoul was unable to recover Pixx's body, finding only the scarf she'd been wearing.As a result of Black September, the history of the Ultraverse was drastically altered.  Certain characters (such as Hardcase, Choice, the Jimmy Ruiz Prototype and Contrary) ceased to exist in this revamped reality.  This included Pixx as well, as revealed by a newly returned Hardcase in his efforts to aid Ultraforce against the Demonseed (by explaining what exactly the Infinity Effect had on the Ultraverse reality).  Not even Ghoul remembered his former teammate, whose sacrifice now may not have even happened.",
  "isHero": false,
  "isVillain": false,
  "name": "Pixx",
  "partners": [
  ],
  "powers": [
  ],
  "ranking": {
    "comicCount": 0,
    "eventCount": 0,
    "pageviewCount": 760,
    "pageviewRank": -1,
    "serieCount": 0,
    "storyCount": 0
  },
  "secretIdentities": [
  ],
  "species": [
  ],
  "urls": {
    "wikipedia": "https://en.wikipedia.org/wiki/Pixx"
  }
}