{
  "aliases": [
    "Randall Flagg"
  ],
  "alliances": [
  ],
  "authors": [
  ],
  "description": "Randall Flagg is a fictional character created by Stephen King. Flagg has appeared in at least nine of King's novels, either as a major or very minor character. He has a variety of names, usually initialed \"R.F.\" but with occasional exceptions, such as Walter o'Dim (originally envisioned by King as a separate character) in The Dark Tower series. Flagg is described as \"an accomplished sorcerer and a devoted servant of the Outer Dark\", with supernatural abilities involving necromancy, prophecy, and influence over animal and human behavior. His goals typically center on bringing down civilizations through destruction and conflict.Flagg first appeared in The Stand as a demonic figure who wreaks havoc after a plague kills most of the population. He makes his second appearance in The Eyes of the Dragon as an evil wizard trying to plunge the fictional medieval city of Delain into chaos. Flagg was a primary antagonist in King's epic series, The Dark Tower, who tries to keep protagonist Roland Deschain from reaching the Tower (the linchpin of existence) so he can claim it for himself and become a god. The Dark Tower expanded on Flagg's background and motivation, linking his previous appearances. Aside from King's novels, Flagg was featured in a television miniseries adaptation of The Stand (played by Jamey Sheridan) and appeared in Marvel Comics' adaptations of The Dark Tower and The Stand. King initially cited Donald DeFreeze, primary kidnapper of Patty Hearst, as his inspiration for Flagg. Later, he attributed Flagg to an image of a man walking the roads in cowboy boots, denim jeans, and a jacket, a notion which \"came out of nowhere\" when he was in college. Flagg's character and the nature of his evil have been the subject of considerable critical attention.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/8/d0/4ce5a67201a4e/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Randall Flagg",
  "partners": [
  ],
  "powers": [
  ],
  "ranking": {
    "comicCount": 1,
    "eventCount": 0,
    "pageviewCount": 18646,
    "pageviewRank": -1,
    "serieCount": 1,
    "storyCount": 1
  },
  "secretIdentities": [
  ],
  "species": [
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/2914/randall_flagg",
    "wikipedia": "https://en.wikipedia.org/wiki/Randall_Flagg"
  }
}