{
  "aliases": [
  ],
  "alliances": [
    "Weapon P.R.I.M.E.",
    "X-Factor Investigations",
    "X-Factor",
    "X-Force",
    "New Mutants",
    "X-Corporation",
    "X-Terminators",
    "Purifiers"
  ],
  "authors": [
    "Walt Simonson",
    "Louise Simonson"
  ],
  "description": "Rictor (Julio Esteban \"Ric\" Richter) is a fictional comic book superhero in the Marvel Universe, who appears in the X-Men family of books published by Marvel Comics.  He was created by writer Louise Simonson and artist Walt Simonson and first appeared in X-Factor #17 (June 1987). In subsequent years, the character was featured as a member of the original New Mutants team and  the original X-Force team, and continued to appear in various X-Men franchise publications thereafter. In comic books published in the 1980s and 1990s, Rictor's mutant powers were to generate seismic energy and tremendously powerful vibrations in any nearby object, inducing earthquake-like phenomena and causing objects to shatter or crumble. When the character was reintroduced in 2005, it was as one of many depowered mutants adjusting to civilian life. The character remained depowered until a 2011 comic.Introduced in the late 1980s as a supporting character in X-Factor, Rictor appeared in Marvel comics for ten years under the pens of a number of different writers; much of his character development in this period came from Fabian Nicieza's run on X-Force. The character returned to publication in 2005 with the X-Factor vol.3 and has been written by Peter David continually since then. Responding to fan interest in the gay subtext surrounding the character in Jeph Loeb's X-Force run, Rictor's kiss with teammate Shatterstar in the pages of X-Factor vol.3 in 2009 became the first depiction of a same-sex kiss in a mainstream Marvel Comics publication. Since then, Rictor has been written as an out gay man who is fully accepting of his sexual identity, and one of few gay superheroes in the Marvel Universe.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/3/03/527414130f76d/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Rictor",
  "partners": [
  ],
  "powers": [
    "Capable of releasing seismic energy through his fingertips",
    "using it to create earthquakes",
    "shockwaves or otherwise transport earth matter."
  ],
  "ranking": {
    "comicCount": 89,
    "eventCount": 5,
    "pageviewCount": 4832,
    "pageviewRank": -1,
    "serieCount": 19,
    "storyCount": 96
  },
  "secretIdentities": [
    "Julio Esteban \"Ric\" Richter"
  ],
  "species": [
    "Mutant"
  ],
  "urls": {
    "marvel": "http://marvel.com/comics/characters/1009542/rictor",
    "wikipedia": "https://en.wikipedia.org/wiki/Rictor"
  }
}