{
  "aliases": [
    "Anna Marie",
    "Rogue",
    "Anna Raven",
    "Dr. Kellogg",
    "Miss Smith"
  ],
  "alliances": [
    "Avengers Unity Division",
    "X-Men",
    "XSE",
    "Brotherhood of Evil Mutants",
    "Xavier Institute",
    "Jean Grey School"
  ],
  "authors": [
  ],
  "description": "Rogue is a fictional character, a superhero appearing in most of the Marvel Comics X-Men related titles. She debuted in Avengers Annual #10 (November 1981) as a villain. An earlier story intended for Ms. Marvel #25 (June 1979) went unpublished until 1992. Rogue is a mutant. More so than most, Rogue considers her powers a curse: she involuntarily absorbs and sometimes also removes the memories, physical strength, and superpowers of anyone she touches. For most of her life, she limited her physical contact with others, including her on-off love interest, Gambit, but after many years Rogue finally gained full control over her mutant ability.Hailing from the fictional Caldecott County, Mississippi, Rogue is the X-Men's self-described southern belle. A runaway, she was adopted by Mystique of the Brotherhood of Evil Mutants and grew up as a villain. After Rogue permanently absorbs Ms. Marvel's psyche and Kree powers, she reforms and turns to the X-Men, fearing for her sanity. Rogue's real name and early history were not revealed until nearly twenty years after her introduction. Until the back story provided by Robert Rodi in the ongoing Rogue series which began in September 2004 where Rogue's background was only hinted at. Her name was revealed as Anna Marie, although her surname is still unknown. She has sometimes been called Raven which is the first name of her foster mother Mystique.Rogue has been one of the most popular and consistent members of the X-Men since the 1980s. She was #5 on IGN's Top 25 X-Men list for 2006, #4 on their Top Ten X-Babes list for 2006, #3 on Marvel's list of Top 10 Toughest Females for 2009 and was given title of #1 X-Man on CBR's Top 50 X-Men of All Time for 2008. She was ranked tenth in Comics Buyer's Guide's \"100 Sexiest Women in Comics\" list.  Rogue has been featured in most of the X-Men animated series and various video games. In the X-Men film series, she is portrayed by Academy Award-winning actress Anna Paquin. Her visual cue is often the white streak that runs through her hair.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/3/10/5112d84e2166c/standard_xlarge.jpg",
  "isHero": true,
  "isVillain": true,
  "name": "Rogue",
  "partners": [
  ],
  "powers": [
    "Absorption of powers",
    "skills",
    "memories by touch",
    "Super strength",
    "Flight",
    "(",
    "Details"
  ],
  "ranking": {
    "comicCount": 417,
    "eventCount": 19,
    "pageviewCount": 48801,
    "pageviewRank": -1,
    "serieCount": 112,
    "storyCount": 524
  },
  "secretIdentities": [
    "Anna Marie",
    "Anna Marie (full name unrevealed)"
  ],
  "species": [
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/48/rogue",
    "wikipedia": "https://en.wikipedia.org/wiki/Rogue_(comics)"
  }
}