{
  "aliases": [
    "Victor Creed"
  ],
  "alliances": [
    "Team X",
    "The Hand",
    "Brotherhood of Mutants",
    "X-Men",
    "Weapon X",
    "Marauders",
    "X-Factor"
  ],
  "authors": [
    "John Byrne",
    "Chris Claremont"
  ],
  "description": "Sabretooth (Victor Creed) is a fictional character, a Marvel Comics supervillain created by writer Chris Claremont and artist/co-writer John Byrne. The character first appeared in Iron Fist #14 (August 1977). Originally portrayed as a non-powered serial killer, Sabretooth is later written as a mutant who possesses bestial superhuman abilities, most notably a rapid healing factor, razor-sharp fangs and claws, and superhuman senses. He is a vicious assassin responsible for numerous deaths both as a paid mercenary and for his personal pleasure.The character Wolverine is depicted as his long-time enemy, although conflicting accounts have been given as to the origin of their feud. It is also known that he and Sabretooth were victims of the Cold War supersoldier program Weapon X, and that Sabretooth saw Wolverine as competition and tried to make his life miserable. While Wolverine is depicted as suppressing his more savage qualities, Sabretooth does the opposite and embraces them.Sabretooth has appeared in several X-Men animated series and video games. Played by Tyler Mane, he was a henchman of Magneto in the first X-Men film and X-Men: The Official Game. Liev Schreiber plays him in the 2009 film X-Men Origins: Wolverine. In May 2008, Wizard magazine ranked Sabretooth #193 of the 200 best comic book characters of all time. In 2009, Sabretooth was also ranked as IGN's 44th Greatest Comic Book Villain of All Time.",
  "image": "http://i.annihil.us/u/prod/marvel/i/mg/1/00/4ce1895117793/standard_xlarge.jpg",
  "isHero": false,
  "isVillain": true,
  "name": "Sabretooth",
  "partners": [
  ],
  "powers": [
    "Regenerative healing factor",
    "Superhuman senses",
    "strength",
    "stamina",
    "agility",
    "reflexes",
    "Resistance to telepathic assault",
    "control",
    "Retractable claws",
    "sharp teeth",
    "Extended longevity due to healing factor"
  ],
  "ranking": {
    "comicCount": 162,
    "eventCount": 5,
    "pageviewCount": 36490,
    "pageviewRank": -1,
    "serieCount": 60,
    "storyCount": 167
  },
  "secretIdentities": [
    "Victor Creed"
  ],
  "species": [
    "Mutant"
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/1975/sabretooth",
    "wikipedia": "https://en.wikipedia.org/wiki/Sabretooth_(comics)"
  }
}