{
  "aliases": [
    "Armadillo",
    "Porcupine",
    "Spyke"
  ],
  "alliances": [
    "Brotherhood of Mutants",
    "Morlocks",
    "X-Men",
    "The Morlocks"
  ],
  "authors": [
    "Robert N. Skir",
    "Steven E. Gordon"
  ],
  "description": "Spyke (Evan Daniels) is a character who was briefly a member of the X-Men in the animated series X-Men: Evolution. Created by writer Robert N. Skir and artist Steven E. Gordon, he first appeared in \"Speed And Spyke\", episode #5 (December 9, 2000), where he was voiced by Neil Denis.Spyke is a high-school freshman with the mutant ability to project spikes out of his body.The character was originally created as a way to diversify the show's X-Men roster. It was important to the show's creators, the WB network (who ran the show) and Marvel Comics to have an African American in the show. According to the show's producer Boyd Kirkland, turning Bishop (the first Black male X-Man) into a teenager would not have worked. Initially, Spyke was intended to be the team's muscle and looked closer to how he looked in season four, but Marvel decided they didn't like the \"monster\" angle and he was given a much more normal look. He was originally intended to be called Armadillo and have cornrows. He has similar powers to Marrow, a pre-existing character, though Kirkland says this was not intentional.",
  "image": "https://upload.wikimedia.org/wikipedia/en/thumb/2/21/Spyke.jpg/220px-Spyke.jpg",
  "isHero": false,
  "isVillain": false,
  "name": "Spyke",
  "partners": [
  ],
  "powers": [
    "Can extend self-repairing exoskeleton",
    "Projectile spikes",
    "Later able to produce flaming spikes",
    "Regenerative Healing Factor",
    "Enhanced strength"
  ],
  "ranking": {
    "comicCount": 0,
    "eventCount": 0,
    "pageviewCount": 4051,
    "pageviewRank": -1,
    "serieCount": 0,
    "storyCount": 0
  },
  "secretIdentities": [
    "Evan Daniels"
  ],
  "species": [
  ],
  "urls": {
    "marvel": "http://marvel.com/characters/2185/spyke",
    "wikipedia": "https://en.wikipedia.org/wiki/Spyke"
  }
}